src/cf/ChartsOfCharacteristicTypes/пбп_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>пбп_ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:Type>d5p1:CatalogRef.пбп_ПользовательскиеФункции</v8:Type>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.пбп_ПредопределенныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кэшируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.пбп_ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/пбп_ПредопределенныеЗначения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеХранилища = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Объект.Пароль Тогда
		ДанныеХранилища = Новый Структура("bit_password", Объект.Значение);
		пбп_Переадресация.ЗаписатьДанныеВБезопасноеХранилище(
			Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор()), ДанныеХранилища);
		ТекущийОбъект.Значение = "";
	Иначе
		пбп_Переадресация.ЗаписатьДанныеВБезопасноеХранилище(
			Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор()), Неопределено);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	УстановитьНаличиеПароля(ДанныеХранилища);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение",
		ЭтотОбъект, Новый Структура("РеквизитШапки, ТолькоПросмотр, Реквизит", Истина, Истина, "Наименование")),
		Объект.Наименование, НСтр("ru='Наименование'; en = 'Name'"), , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Значение) <> Тип("Строка") Тогда
		
		Объект.Пароль = Ложь;
		
		пбп_ПереадресацияКлиент.СообщитьПользователю(
			НСтр("ru='Пароль может использовать только тип ""Строка"".';
			| en='The password can only use the type ""String"".'"),
			Объект.Ссылка, "ТипЗначения", "Объект.ТипЗначения");
		
		Возврат;
		
	ИначеЕсли Объект.Пароль И Объект.СписокЗначений Тогда
		
		Объект.Пароль = Ложь;
		
		пбп_ПереадресацияКлиент.СообщитьПользователю(
			НСтр("ru='Использование пароля недоступен для списка значений.';
			| en='Password usage is not available for the list of values.'"),
			Объект.Ссылка, "СписокЗначений", "Объект.СписокЗначений");
			
		Возврат;
		
	ИначеЕсли НЕ Объект.Пароль И ЗначениеЗаполнено(Объект.Значение) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПарольПриИзмененииПродолжение", ЭтотОбъект),
			НСтр("ru='Пароль будет очищен. Продолжить?'; 
			| en='The password will be cleared. Continue?'"),
			РежимДиалогаВопрос.ДаНет, 60);
		
	Иначе
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Значение) <> Тип("Строка") ИЛИ Объект.Пароль Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение",
		ЭтотОбъект, Новый Структура("РеквизитШапки, Реквизит", Истина, "Значение")),
		Объект.Значение, НСтр("ru='Значение'; en = 'Value'"), , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение",
		ЭтотОбъект, Новый Структура("РеквизитШапки, Реквизит", Истина, "Комментарий")),
		Объект.Комментарий, НСтр("ru='Комментарий'; en = 'Comment'"), , Истина);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ЗначенияЭлементовЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияЭлементов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Значение) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение",
		ЭтотОбъект, Новый Структура("РеквизитШапки, Реквизит", Ложь, ТекущиеДанные)),
		ТекущиеДанные.Значение, НСтр("ru='Значение'; en = 'Value'"), , Истина);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормы

#Область ОбработчикиКомандФормы

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НадписьНаличиеПароля", "Видимость", Объект.Пароль);
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Значение", "Видимость", Не Объект.СписокЗначений);
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Значение", "КнопкаВыбора", Не Объект.Пароль);
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Значение", "РежимПароля", Объект.Пароль);
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Значение", "КнопкаОткрытия", Не Объект.Пароль);
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗначенияЭлементов", "Видимость", Объект.СписокЗначений);
	пбп_ПереадресацияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокЗначений", "ТолькоПросмотр", Объект.Пароль);
	
	УстановитьНаличиеПароля();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНаличиеПароля(ДанныеХранилища = Неопределено);
	
	Если НЕ Объект.Пароль Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеХранилища = Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеХранилища = пбп_Переадресация.ПрочитатьДанныеИзБезопасногоХранилища(
			Строка(Объект.Ссылка.УникальныйИдентификатор()));
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеХранилища) = Тип("Структура")
		И НЕ ПустаяСтрока(пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(ДанныеХранилища, "bit_password", "")) Тогда
		
		Элементы.НадписьНаличиеПароля.Заголовок = НСтр("ru = 'Пароль установлен'");
	Иначе
		Элементы.НадписьНаличиеПароля.Заголовок = НСтр("ru = 'Пустой пароль'")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзмененииПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Значение = "";
	Иначе
		Объект.Пароль = Истина;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ТолькоПросмотр", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		Если пбп_ПереадресацияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "РеквизитШапки", Ложь) Тогда
			Объект[ДополнительныеПараметры.Реквизит] = Результат;
		Иначе
			ДополнительныеПараметры.Реквизит.Значение = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
